driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_Exit/Output1.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><EventHandler3Element xmlns="EventHandler3"><string>MainReply:  6.11</string></EventHandler3Element></SOAP-ENV:Body></SOAP-ENV:Envelope>