driver-tests/bpelse/eventHandlers/onAlarmJbi/test/basic_repeatedAlarm/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:for="EventHandler3">
    <soapenv:Body>
            <for:item>
                <for:value>1.2</for:value>
            </for:item> 
    </soapenv:Body>
</soapenv:Envelope>