driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_Exit/Input2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="EventHandler3">
  <soapenv:Body><inv:EventHandler3Element2>
<inv:string2>6.11</inv:string2>
       </inv:EventHandler3Element2>
  </soapenv:Body>
</soapenv:Envelope>