driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_ElseIfScope/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="EventHandler3">
  <soapenv:Body>
    <even:EventHandler3Operation>
      <part1>
        <even:FirstMessage>2.11</even:FirstMessage>
        <even:CorrelatedMessage>2.11</even:CorrelatedMessage>
        <even:OnEventMessage>2.11</even:OnEventMessage>
      </part1>
    </even:EventHandler3Operation>
  </soapenv:Body>
</soapenv:Envelope>