driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_Exit/Input1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="EventHandler3">
  <soapenv:Body><inv:EventHandler3Element>
<inv:string>6.11</inv:string>
       </inv:EventHandler3Element>
  </soapenv:Body>
</soapenv:Envelope>