driver-tests/bpelse/eventHandlers/onEventJBI/test/basic_onEvent_Exit/Output2.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><inv:EventHandler3Element2 xmlns:inv="EventHandler3">
<inv:string2>6.11</inv:string2>
       </inv:EventHandler3Element2></SOAP-ENV:Body></SOAP-ENV:Envelope>